In [1]:
import sqlalchemy
import pymysql

pymysql.install_as_MySQLdb()

%load_ext sql

# Connect to a database in mySQL

In [2]:
sqlalchemy.create_engine('mysql://ramadian:password@localhost/snp500')

Engine(mysql://ramadian:***@localhost/snp500)

In [3]:
%sql mysql://ramadian:password@localhost/snp500

'Connected: ramadian@snp500'

###################################################

# Create tableA_CompanyStockPrices

In [4]:
%%sql
CREATE TABLE tableA_CompanyStockPrices
    (Ticker varchar(5),
     StockPrice decimal(6,2)
    )

 * mysql://ramadian:***@localhost/snp500
0 rows affected.

[]

In [8]:
%%sql
INSERT INTO tableA_CompanyStockPrices(Ticker, StockPrice) 
VALUES 
    ('AMZN', 350.5),
    ('BBY', 68.79),
    ('CMCSA', 38.19),
    ('DG', 95.1)

 * mysql://ramadian:***@localhost/snp500
4 rows affected.

[]

# Create tableB_CompanyNames

In [9]:
%%sql
CREATE TABLE tableB_CompanyNames
    (Ticker varchar(5),
     CompanyName varchar(50)
    )

 * mysql://ramadian:***@localhost/snp500
0 rows affected.

[]

In [10]:
%%sql
INSERT INTO tableB_CompanyNames(Ticker, CompanyName)
VALUES
    ('AMZN', 'Amazon.com Inc'),
    ('BBY', 'Best Buy Co. Inc'),
    ('CMCSA', 'Comcast Corp.'),
    ('F', 'Ford Motor')

 * mysql://ramadian:***@localhost/snp500
4 rows affected.

[]

------------------------------------------------------------------------------------------------------------------

In [12]:
%sql SELECT * FROM tableA_CompanyStockPrices

 * mysql://ramadian:***@localhost/snp500
4 rows affected.

[('AMZN', Decimal('350.50')),
 ('BBY', Decimal('68.79')),
 ('CMCSA', Decimal('38.19')),
 ('DG', Decimal('95.10'))]

In [13]:
%sql SELECT * FROM tableB_CompanyNames

 * mysql://ramadian:***@localhost/snp500
4 rows affected.

[('AMZN', 'Amazon.com Inc'),
 ('BBY', 'Best Buy Co. Inc'),
 ('CMCSA', 'Comcast Corp.'),
 ('F', 'Ford Motor')]

--------------------------------------------------------------------------------------------------

# INNER JOIN: Column-wise

In [15]:
%%sql
SELECT
    ta.Ticker, tb.CompanyName, ta.StockPrice
FROM 
    tableA_CompanyStockPrices ta 
    INNER JOIN 
    tableB_CompanyNames tb 
    ON ta.Ticker = tb.Ticker

 * mysql://ramadian:***@localhost/snp500
3 rows affected.

[('AMZN', 'Amazon.com Inc', Decimal('350.50')),
 ('BBY', 'Best Buy Co. Inc', Decimal('68.79')),
 ('CMCSA', 'Comcast Corp.', Decimal('38.19'))]

# LEFT OUTER JOIN

In [17]:
%%sql
SELECT
    ta.Ticker, tb.CompanyName, ta.StockPrice
FROM 
    tableA_CompanyStockPrices ta 
    LEFT OUTER JOIN 
    tableB_CompanyNames tb 
    ON ta.Ticker = tb.Ticker

 * mysql://ramadian:***@localhost/snp500
4 rows affected.

[('AMZN', 'Amazon.com Inc', Decimal('350.50')),
 ('BBY', 'Best Buy Co. Inc', Decimal('68.79')),
 ('CMCSA', 'Comcast Corp.', Decimal('38.19')),
 ('DG', None, Decimal('95.10'))]

# RIGHT OUTER JOIN: be careful with column name

In [19]:
%%sql
SELECT
    tb.Ticker, tb.CompanyName, ta.StockPrice
FROM 
    tableA_CompanyStockPrices ta 
    RIGHT OUTER JOIN 
    tableB_CompanyNames tb 
    ON ta.Ticker = tb.Ticker

 * mysql://ramadian:***@localhost/snp500
4 rows affected.

[('AMZN', 'Amazon.com Inc', Decimal('350.50')),
 ('BBY', 'Best Buy Co. Inc', Decimal('68.79')),
 ('CMCSA', 'Comcast Corp.', Decimal('38.19')),
 ('F', 'Ford Motor', None)]

# CROSS JOIN: to double or tripe or ... data set

In [21]:
%%sql
CREATE TABLE GroupNumbers
(Number int
)

 * mysql://ramadian:***@localhost/snp500
0 rows affected.

[]

In [23]:
%%sql
INSERT INTO GroupNumbers(Number)
VALUES
    (1),
    (2),
    (3)

 * mysql://ramadian:***@localhost/snp500
3 rows affected.

[]

In [24]:
%%sql
SELECT
    tx.Ticker, tx.CompanyName, tx.StockPrice, tcross.Number
FROM
    (SELECT
        ta.Ticker, tb.CompanyName, ta.StockPrice
     FROM 
        tableA_CompanyStockPrices ta 
        INNER JOIN 
        tableB_CompanyNames tb 
        ON ta.Ticker = tb.Ticker) tx
    CROSS JOIN 
    GroupNumbers tcross

 * mysql://ramadian:***@localhost/snp500
9 rows affected.

[('AMZN', 'Amazon.com Inc', Decimal('350.50'), 1),
 ('AMZN', 'Amazon.com Inc', Decimal('350.50'), 2),
 ('AMZN', 'Amazon.com Inc', Decimal('350.50'), 3),
 ('BBY', 'Best Buy Co. Inc', Decimal('68.79'), 1),
 ('BBY', 'Best Buy Co. Inc', Decimal('68.79'), 2),
 ('BBY', 'Best Buy Co. Inc', Decimal('68.79'), 3),
 ('CMCSA', 'Comcast Corp.', Decimal('38.19'), 1),
 ('CMCSA', 'Comcast Corp.', Decimal('38.19'), 2),
 ('CMCSA', 'Comcast Corp.', Decimal('38.19'), 3)]

--------------

##################################################################################3

In [25]:
%%sql
CREATE TABLE tableA_CompanyStockPrices_2
    (Ticker varchar(5),
     StockPrice decimal(6,2)
    )

 * mysql://ramadian:***@localhost/snp500
0 rows affected.

[]

In [26]:
%%sql
INSERT INTO tableA_CompanyStockPrices_2(Ticker, StockPrice) 
VALUES 
    ('AMZN', 350.5),
    ('BBY', 68.79),
    ('CMCSA', 38.19),
    ('F', 10.43)

 * mysql://ramadian:***@localhost/snp500
4 rows affected.

[]

In [27]:
%sql SELECT * FROM tableA_CompanyStockPrices

 * mysql://ramadian:***@localhost/snp500
4 rows affected.

[('AMZN', Decimal('350.50')),
 ('BBY', Decimal('68.79')),
 ('CMCSA', Decimal('38.19')),
 ('DG', Decimal('95.10'))]

In [28]:
%sql SELECT * FROM tableA_CompanyStockPrices_2

 * mysql://ramadian:***@localhost/snp500
4 rows affected.

[('AMZN', Decimal('350.50')),
 ('BBY', Decimal('68.79')),
 ('CMCSA', Decimal('38.19')),
 ('F', Decimal('10.43'))]

# UNION and UNION ALL: Row-wise

In [29]:
%%sql
SELECT * FROM tableA_CompanyStockPrices
UNION
SELECT * FROM tableA_CompanyStockPrices_2

 * mysql://ramadian:***@localhost/snp500
5 rows affected.

[('AMZN', Decimal('350.50')),
 ('BBY', Decimal('68.79')),
 ('CMCSA', Decimal('38.19')),
 ('DG', Decimal('95.10')),
 ('F', Decimal('10.43'))]

In [30]:
%%sql
SELECT * FROM tableA_CompanyStockPrices
UNION ALL
SELECT * FROM tableA_CompanyStockPrices_2

 * mysql://ramadian:***@localhost/snp500
8 rows affected.

[('AMZN', Decimal('350.50')),
 ('BBY', Decimal('68.79')),
 ('CMCSA', Decimal('38.19')),
 ('DG', Decimal('95.10')),
 ('AMZN', Decimal('350.50')),
 ('BBY', Decimal('68.79')),
 ('CMCSA', Decimal('38.19')),
 ('F', Decimal('10.43'))]

# INTERSECT (emulate: MySQL doesn't suppor INTERSECT)

In [36]:
%%sql
SELECT DISTINCT
    t1.Ticker, t1.StockPrice
FROM 
    tableA_CompanyStockPrices t1
    INNER JOIN
    tableA_CompanyStockPrices_2 t2
    ON t1.Ticker = t2.Ticker

 * mysql://ramadian:***@localhost/snp500
3 rows affected.

[('AMZN', Decimal('350.50')),
 ('BBY', Decimal('68.79')),
 ('CMCSA', Decimal('38.19'))]

# EXCEPT (emulate: MySQL doesn't support EXCEPT)

In [38]:
%%sql
SELECT
    t1.Ticker, t1.StockPrice
FROM
    tableA_CompanyStockPrices t1
WHERE
    t1.Ticker NOT IN (SELECT t2.Ticker FROM tableA_CompanyStockPrices_2 t2)

 * mysql://ramadian:***@localhost/snp500
1 rows affected.

[('DG', Decimal('95.10'))]